app/controllers/home_controller.rb

SELECT "widgets".* FROM "widgets"
SELECT "widget_stats".* FROM "widget_stats" WHERE "widget_stats"."widget_id" = ?  [["widget_id", 1]]
---
  def area_chart
    @data = Widget.all
    @series = @data.map{|w| w.widget_stats}

SELECT "widgets".* FROM "widgets"
---
  def bar_chart
    @widgets = Widget.all

SELECT "widgets".* FROM "widgets"
---
  def column_chart
    @widgets = Widget.all

SELECT "widgets".* FROM "widgets"
---
  def gauge
    @data = Widget.all

SELECT "locations".* FROM "locations"
---
  def geo_chart
    @locations = Location.all

SELECT "widgets".* FROM "widgets"
SELECT "widget_stats".* FROM "widget_stats" WHERE "widget_stats"."widget_id" = ?  [["widget_id", 1]]
---
  def line_chart
    @data = Widget.all
    @series = @data.map{|w| w.widget_stats}

SELECT "widgets".* FROM "widgets"
---
  def pie_chart
    @data = Widget.all